Revit 2020 API
FormatOptions Constructor
Overload List
Name | Description
FormatOptions()
 Creates a new FormatOptions object that represents default formatting.
FormatOptions(DisplayUnitType)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(FormatOptions)
 Creates a copy of a FormatOptions object.
FormatOptions(DisplayUnitType, UnitSymbolType)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, Double)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, UnitSymbolType, Double)
 Creates a new FormatOptions object that represents custom formatting.
See Also
FormatOptions Class
FormatOptions Members
Autodesk.Revit.DB Namespace